Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། དགོན་པའི་ཕྱོགས་སམ། རིའི་སྨན་ལྗོངས་སམ། ཕོ་བྲང་འཁོར་གང་དུ་གནས་པར་འགྱུར་བའི་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། དགོན་པའི་ཕྱོགས་སམ།
en: Then Dṛḍhā, the goddess of the earth, said to the Bhagavat, “Venerable Bhagavat, wherever this Lord King of Sūtras, the Sublime Golden Light is taught, in the present or in future times, whether in a village, town, market town, region, wilderness, mountain cave, or royal residence—wherever, Bhagavat, this Lord King of Sūtras, the Sublime Golden Light is taught at length—I, Dṛḍhā, the goddess of the earth, will come to that place.

source: རིའི་སྨན་ལྗོངས་སམ། ཕོ་བྲང་འཁོར་དེར་བཙུན་པ་བཅོམ་ལྡན་འདས་སའི་ལྷ་མོ་བརྟན་མ་བདག་མཆི་བར་བགྱིའོ། །བཅོམ་ལྡན་འདས་གང་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་འཆད་པར་འགྱུར་བ་དང་། ས་ཕྱོགས་གང་དང་གང་ན་དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་ཆོས་ཀྱི་ཁྲི་ཤོམ་པར་འགྱུར་བ་དང་། གང་དང་གང་དུ་ཆོས་སྨྲ་བ་དེ་སྟན་ལ་མཆིས་ནས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་འགྱུར་བ་དེར། བཙུན་པ་བཅོམ་ལྡན་འདས་སའི་ལྷ་མོ་བརྟན་མ་བདག་ས་ཕྱོགས་དེ་དང་དེ་ཉིད་དུ་མཆི་བར་བགྱིའོ། །
en: “Wherever a Dharma throne is arranged for the dharmabhāṇaka bhikṣu, and wherever the dharmabhāṇaka, upon that throne, extensively teaches this Lord King of Sūtras, the Sublime Golden Light, venerable Bhagavat, I, Dṛḍhā, the goddess of the earth, will come to that place.

source: ལུས་འདི་མི་གདའ་བར་ཆོས་ཀྱི་ཁྲིའི་འོག་ལོགས་སུ་མཆིས་ཏེ། ཡན་ལག་གི་དམ་པ་མགོས་དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་རྐང་མཐིལ་ནས་བརྟེན་པར་བགྱིའོ། །
en: With my body invisible, I will go beneath that Dharma throne, and with my highest limb, my head, I will support that dharmabhāṇaka bhikṣu under the soles of his feet.

source: བདག་ཀྱང་ཆོས་མཉན་པ་དང་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་ཚིམ་པར་བགྱི། ཡང་དག་པར་རིམ་གྲོ་བགྱི།
en: “I also will listen to the Dharma and be satiated by this distilled nectar of the Dharma.

source: ཡང་དག་པར་མཆོད་པར་བགྱིའོ། །བདག་ཚིམ་པར་གྱུར། རིམ་གྲོ་བགྱི་བ་བགྱིས་པར་གྱུར།
en: I will honor him; I will make offerings to him.

source: རབ་ཏུ་དགའ་བར་གྱུར་ནས། སའི་ཕུང་པོ་དཔག་ཚད་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་པོ་འདི་ནས་སའི་གཞི་རྡོ་རྗེ་ལ་ཐུག་པའི་བར་དུ་སའི་བཅུད་ཀྱིས་རྣམ་པར་འཕེལ་བར་བགྱི།
en: Having been satiated, having honored him, and being delighted, I will increase the fertility of this sixty-eight-thousand-yojana-wide aggregation of the earth down to its vajra foundation.

source: ཡང་དག་པར་རིམ་གྲོ་བགྱི་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ། །
en: I will honor it and perfect it.

source: སྟེང་དུ་ཡང་རྒྱ་མཚོའི་མཐའ་ལ་ཐུག་པའི་སའི་དཀྱིལ་འཁོར་འདི་སའི་བཅུད་ཀྱི་སྣུམ་གྱིས་བརླན་པར་བགྱིའོ། །
en: On its surface I will saturate it, this disk of the earth, as far as the ocean, with the oil of the earth’s fertility.

source: ས་ཆེན་པོ་འདི་རབ་ཏུ་མདངས་དང་ལྡན་པར་བགྱིའོ། །
en: I will cause this great earth to be resplendent.

source: དེས་ན་འཛམ་བུའི་གླིང་འདིར་རྩྭ་དང་ཤིང་གེལ་པ་དང་སྨན་དང་ནགས་ཚལ་སྣ་ཚོགས་རྣམས་མདངས་དང་རབ་ཏུ་ལྡན་པར་འཁྲུངས་པར་འགྱུར། ཀུན་དགའི་ར་བ་དང་། ནགས་ཚལ་དང་།
en: Then, in this Jambudvīpa, the grass, bushes, herbs, and forests will grow with perfect resplendence.

source: ཤིན་ལྗོན་པ་ཐམས་ཅད་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་ཏོག་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མདངས་དང་ལྡན་པར་འགྱུར།
en: All parks, forests, trees, leaves, flowers, fruits, and harvests of various kinds will be resplendent, aromatic, lustrous, delicious, beautiful, and huge.

source: དྲི་དང་རབ་ཏུ་ལྡན་པ་དང་། སྣུམ་དང་རབ་ཏུ་ལྡན་པ་དང་། རོ་ཞིམ་པོར་འགྱུར་བ་བལྟ་ན་རབ་ཏུ་སྡུག་པ་དང་རབ་ཏུ་ཆེ་བར་འགྱུར་རོ། །སེམས་ཅན་དེ་དག་ཀྱང་བཏུང་བ་དང་བཟའ་བ་རྣམ་པ་སྣ་ཚོགས་དེ་དག་འཚལ་ནས། ཚེ་དང་སྟོབས་དང་ཁ་དོག་དང་དབང་པོ་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །
en: “When beings consume them as various kinds of drink and food, their lifespan, strength, complexion, and faculties will increase.

source: གཟི་བརྗིད་དང་སྟོབས་དང་ཁ་དོག་དང་གཟུགས་དང་ལྡན་པར་གྱུར་ནས་ཀྱང་ས་ལ་མཆིས་པའི་དགོས་པ་རྣམ་པ་སྣ་ཚོགས་ཐ་དད་པ་བརྒྱ་སྟོང་དུ་མ་དག་བགྱིད་པར་འགྱུར།
en: Being endowed with such majesty, strength, complexion, and form, they will accomplish many hundreds of thousands of the various different things necessary on this earth.

source: བརྩོན་པར་འགྱུར། འབད་པར་འགྱུར།
en: They will be dedicated to that and make an effort in that.

source: སྟོབས་སུ་བགྱིད་པའི་ལས་རྣམས་བགྱིད་པར་འགྱུར་རོ། །
en: They will accomplish actions that create strength.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་དེས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཞི་བ་དང་ལོ་ལེགས་པ་དང་རྒྱས་པ་དང་ཉམས་དགའ་བར་འགྱུར།
en: “Venerable Bhagavat, this will cause all of Jambudvīpa to have peace, good harvests, increase, and joy.

source: མིའི་སྐྱེ་བོ་མང་པོས་གང་བར་འགྱུར།
en: It will become filled with human beings.

source: འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་འགྱུར། དགའ་བ་རྣམ་པ་སྣ་ཚོགས་མྱོང་བར་འགྱུར།
en: All beings in Jambudvīpa will become happy and experience various kinds of joy.

source: སེམས་ཅན་དེ་དག་གཟི་བརྗིད་དང་སྟོབས་དང་ཁ་དོག་དང་གཟུགས་དང་ལྡན་པར་འགྱུར་རོ། །
en: Those beings will possess majesty, strength, and excellent color and form.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་སླད་དུ་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འདི་འཛིན་པ་དེ་དག་ཆོས་ཀྱི་སྟན་ལ་མཆིས་པའི་གན་དུ་མཆི་བར་འགྱུར།
en: “For the sake of this Lord King of Sūtras, the Sublime Golden Light, bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās should approach the Dharma seat of those who possess this lord king of the sūtras.

source: མཆིས་ནས་ཀྱང་སེམས་རབ་ཏུ་དང་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་ཕན་པ་དང་བདེ་བ་དང་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བགྱི་བའི་སླད་དུ་ཆོས་སྨྲ་བ་དེ་དག་ལ་གསོལ་བ་འདེབས་པར་འགྱུར་རོ། །
en: Having approached it with a perfectly trusting mind, for the welfare, benefit, and happiness of all beings, they should supplicate the dharmabhāṇaka so that this Lord King of Sūtras, the Sublime Golden Light will be taught extensively.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: “Why should they do that?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རབ་ཏུ་བཤད་ན། སའི་ལྷ་མོ་བརྟན་མ་བདག་གཡོག་དང་བཅས་ཏེ།
en: Venerable Bhagavat, if this Lord King of Sūtras, the Sublime Golden Light is taught, I, the earth goddess Dṛḍhā, with my servants, will have supreme resplendence and supreme strength.

source: རབ་ཏུ་མདངས་དང་ལྡན་པ་དང་། རབ་ཏུ་སྟོབས་དང་ལྡན་པར་འགྱུར་རོ། །བདག་ཅག་གི་ལུས་ལ་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། མཐུ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར།
en: Our bodies will develop strength, diligence, and great power.

source: བདག་ཅག་གི་ལུས་ལ་གཟི་བརྗིད་དང་དཔལ་དང་། ཕུན་སུམ་ཚོགས་པ་ཡང་འཇུག་པར་འགྱུར་རོ། །
en: Our bodies will gain magnificence, glory, and splendor.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སའི་ལྷ་མོ་བརྟན་མ་བདག་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་ཚིམ་པར་གྱུར།
en: Venerable Bhagavat, I, the earth goddess Dṛḍhā, will be satiated by this distilled nectar of the Dharma.

source: གཟི་བརྗིད་དང་སྟོབས་དང་། བརྩོན་འགྲུས་དང་མཐུ་དང་ཤུགས་ཆེན་པོ་ཐོབ་པར་གྱུར་ན།
en: I will attain great magnificence, strength, diligence, power, and speed.

source: ས་ཆེན་པོའི་དཔག་ཚད་སྟོང་ཕྲག་བདུན་པའི་འཛམ་བུའི་གླིང་འདིའི་སའི་བཅུད་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་འགྱུར།
en: The great fertility of earth will increase in this Jambudvīpa’s seven thousand yojanas.

source: ས་ཆེན་པོ་མདངས་དང་རབ་ཏུ་ལྡན་པར་འགྱུར་རོ། །
en: The great earth will become magnificent.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ས་ལ་བརྟེན་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་འཕེལ་ཞིང་རྒྱས་ལ་ཡངས་པར་འགྱུར། ཆེན་པོར་ཡང་འགྱུར་རོ། །
en: “Venerable Bhagavat, the beings who dwell upon the earth will increase, expand, and become vast.

source: ས་ལ་གནས་པའི་སེམས་ཅན་དེ་དག་ཆེན་པོར་གྱུར་ནས་ཀྱང་། ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱོད་པ་སྣ་ཚོགས་ལ་སྤྱོད་པར་འགྱུར། བདེ་བ་ཡང་མྱོང་བར་འགྱུར་རོ། །དེ་དག་ཐམས་ཅད་བཟའ་བ་དང་། བཏུང་བ་དང་བཅའ་བ་རྣམ་པ་སྣ་ཚོགས་དང་། གོས་དང་མལ་ཆ་དང་།
en: They will also become widespread, and just as the beings who are upon the earth will become widespread, they will also experience a variety of enjoyments.

source: གནས་དང་། ཁང་པ་དང་། གཞལ་མེད་ཁང་དང་། སྐྱེད་མོས་ཚལ་དང་། ཆུ་བོ་དང་། རྫིང་དང་།
en: They will experience happiness.

source: ཆུ་མིག་དང་། མཚེའུ་དང་། མཚོ་དང་། ལྟེང་ཀ་དང་། འདི་ལྟ་བུའི་ཡོ་བྱད་བདེ་བ་རྣམ་པ་སྣ་ཚོགས་ས་ལ་གནས་པ་ས་ལས་བྱུང་བ་ས་ལ་བརྟེན་པ་འདི་དག་ལ་སྤྱོད་པར་འགྱུར་རོ། །
en: They will all enjoy various kinds of food and drink, remain in various kinds of happiness with the entire variety of pleasurable requisites that are present upon the earth, appear from the earth, and are dependent upon the earth, such as clothes, beds, seats, dwellings, houses, divine palaces, parks, rivers, pools, springs, ponds, lakes, and reservoirs.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་དེས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་བདག་ལ་བྱས་པ་གཟོ་བར་བགྱིའོ། །
en: “Venerable Bhagavat, because of this, all those beings will be repaying my kindness.

source: གདོན་མི་འཚལ་བར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་བསྟི་སྟང་དུ་བགྱིས་ཏེ། མཉན་པར་བགྱི། བཀུར་སྟིར་བགྱི། བླ་མར་བགྱི། རིམ་གྲོར་བགྱི། མཆོད་པར་བགྱིའོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་སེམས་ཅན་དེ་དག་ཆོས་སྨྲ་བ་དེའི་གན་དུ་མཆི་བའི་སླད་དུ།
en: There is no doubt that this Lord King of Sūtras, the Sublime Golden Light should be respected, listened to, honored, venerated, revered, and offered to.

source: རིགས་ཐ་དད་པ་དང་ཁྱིམ་ཐ་དད་པ་དག་ནས་འབྱུང་སྟེ། མཆིས་ནས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པར་གྱུར་ལ། ཐོས་ནས་ཀྱང་རང་རང་གི་རིགས་དང་། ཁྱིམ་དང་གྲོང་དང་གྲོང་རྡལ་ཐ་དད་པ་དག་ཏུ་ཞུགས་ནས། རང་རང་གི་ཁྱིམ་ན་གནས་པ་དག་ཕན་ཚུན་དུ་འདི་སྐད་ཅེས་བདག་ཅག་གིས་དེ་རིང་ཆོས་མཉན་པ་ཟབ་མོ་ཐོས་སོ། །
en: “Venerable Bhagavat, when those beings leave their individual families and individual homes in order to go to the dharmabhāṇaka; and having gone there have listened to this Lord King of Sūtras, the Sublime Golden Light; and having heard it returned to their own individual families, homes, villages, and market towns, they will say to those who live in their own home, ‘We have heard a profound Dharma today.

source: དེ་རིང་བདག་ཅག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བཟུང་ངོ་། །
en: We have obtained an inconceivable accumulation of merit today.

source: བདག་ཅག་གིས་ཆོས་མཉན་པ་དེས་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་མཉེས་པར་བྱས་སོ། །
en: By listening to that Dharma, we have pleased many hundreds of thousands of quintillions of tathāgatas.

source: དེང་བདག་ཅག་གིས་ཆོས་ཉན་པ་འདིས་སེམས་ཅན་དམྱལ་བ་ལས་ཡོངས་སུ་ཐར་ཏོ། །དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ཡི་དགས་ཀྱི་ཡུལ་ལས་ཡོངས་སུ་ཐར་ཏོ། །
en: By listening to that Dharma today, we have been completely freed from rebirth in the hells, as animals, in the world of Yama, and in the realm of the pretas.

source: དེང་བདག་ཅག་ཆོས་ཉན་པ་འདིས་མ་འོངས་པའི་དུས་ན། ཚེ་རབས་བརྒྱ་སྟོང་ཕྲག་དུ་མར་ལྷ་དང་མིར་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ། །ཞེས་གཏམ་ཟེར་བར་འགྱུར་རོ། །ཁྱིམ་ཐ་དད་པ་ན་གནས་པར་འགྱུར་བ་དེ་དག་སེམས་ཅན་གཞན་དག་ལ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་དཔེ་གཅིག་བརྗོད་དམ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་ལེའུ་གཅིག་གམ། སྔོན་བྱུང་བ་གཅིག་གམ།
en: By listening to this Dharma today, we have obtained rebirth in the future as devas and humans for many hundreds of thousands of lifetimes.’

source: ཐ་ན་བྱང་ཆུབ་སེམས་དཔའི་མིང་གཅིག་གམ། དེ་བཞིན་གཤེགས་པའི་མཚན་གཅིག་གམ། ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་གམ། ཚིག་གཅིག་གིས་སེམས་ཅན་གཞན་དག་ལ་ཐོས་པར་བགྱིད་དམ། ཐ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་མཚན་གཞན་དག་ལ་རབ་ཏུ་སྟོན་ཏམ། བཙུན་པ་བཅོམ་ལྡན་འདས་གང་དང་གང་ན་སེམས་ཅན་རྣམ་པ་ཐ་དད་པ་དེ་དག་ས་ཕྱོགས་རྣམ་པ་ཐ་དད་པ་དག་ཏུ་མདོ་སྡེའི་གཏན་ཚིགས་རྣམ་པ་སྣ་ཚོགས་འདི་ལྟ་བུ་འདི་དག་གཅིག་ལ་གཅིག་བརྗོད་དམ།
en: “When they are in their own homes, if they tell even one example from this Lord King of Sūtras, the Sublime Golden Light to those other beings, or just one chapter from this Lord King of Sūtras, the Sublime Golden Light or one history, or even the name of one bodhisattva or the name of one tathāgata, or just one four-line verse or even a single line of verse, and those other beings hear it—or even if they teach others only the name of this Lord King of Sūtras, the Sublime Golden Light—then, venerable Bhagavat, wherever those different beings in different places speak about, or listen to, or talk to one another about these various kinds of causes from the sūtra, then, venerable Bhagavat, all those places will become very resplendent.

source: ཐོས་པར་བགྱིད་དམ། གཏམ་བརྒྱུད་བརྗོད་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་ས་ཕྱོགས་དེ་དག་ཐམས་ཅད་ཤིན་ཏུ་མདངས་དང་ལྡན་པ་དང་ཤིན་ཏུ་སྣུམ་པར་འགྱུར་རོ། །
en: They will become very lustrous.

source: ས་ཕྱོགས་དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར། སའི་བཅུད་རྣམ་པ་སྣ་ཚོགས་དང་ཡོ་བྱད་ཐམས་ཅད་རྒྱས་པར་སྐྱེ་བར་འགྱུར། རྣམ་པར་འཕེལ་བར་འགྱུར། ཤིན་ཏུ་རྒྱས་པར་འགྱུར། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བདེ་བར་འགྱུར་རོ། །
en: In those various places, for all those beings, the various fertilities of the earth and all requisites will increase, augment, and expand, and all those beings will be happy.

source: ནོར་ཆེ་བ་དང་། ལོངས་སྤྱོད་ཆེ་བ་དང་།
en: They will have great wealth and great enjoyments.

source: སྦྱིན་པ་ལ་མོས་པར་འགྱུར། དཀོན་མཆོག་གསུམ་ལ་མངོན་པར་དད་པར་འགྱུར་རོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: They will aspire to generosity, and they will have true faith in the Three Jewels.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སའི་ལྷ་མོ་བརྟན་མ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སའི་ལྷ་མོ་སེམས་ཅན་གང་ལ་ལ་དག་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་ཚིག་གཅིག་ཉན་ན་དེ་དག་མིའི་འཇིག་རྟེན་འདི་ནས་ཤི་འཕོས་ནས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་རིས་ཀྱི་ནང་དུ་ལྷའི་རིས་གང་ཡང་རུང་བ་ཞིག་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །
en: When she had spoken, the Bhagavat said to Dṛḍhā, the goddess of the earth, “Goddess of the earth, if any being listens to even one line from this Lord King of Sūtras, the Sublime Golden Light then when they pass away from this human world, they will be reborn as a deva in the Trāyastriṃśa paradise or among another class of devas.

source: སའི་ལྷ་མོ་སེམས་ཅན་གང་ལ་ལ་དག་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལ་མཆོད་པའི་ཕྱིར། གནས་དེ་དག་ལེགས་པར་བརྒྱན་པར་བྱེད་དམ། ཐ་ན་གདུགས་གཅིག་གམ། བ་དན་གཅིག་གམ། རས་བཅོས་བུ་གཅིག་གིས་གཡོགས་ན་སའི་ལྷ་མོ་རྟག་ཏུ་བརྒྱན་པའི་གནས་དེ་དག་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་རིས་བདུན་པོ་དེ་དག་ཏུ་ལྷའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་རྒྱན་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་པ་དག་ཏུ་གནས་པར་འགྱུར་རོ། །
en: “Goddess of the earth, anyone who, in order to make offerings to this Lord King of Sūtras, the Sublime Golden Light, beautifully adorns those places, even with just one parasol or one flag or by draping one cloth, then, goddess of the earth, they will dwell in those constantly adorned places, divine aerial palaces made of the seven jewels in the seven paradises of the desire realm that are perfectly adorned by all adornments.

source: གང་གི་ཚེ་སེམས་ཅན་དེ་དག་མིའི་འཇིག་རྟེན་འདི་ནས་ཤི་འཕོས་ཏེ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་དེ་དག་ཏུ་སྐྱེ་བ་དེའི་ཚེ། སའི་ལྷ་མོ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་རེ་རེར་ཡང་ལན་བདུན་བདུན་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: When those beings pass away from this human realm, they will be reborn in those aerial palaces made of the seven jewels, and at that time, goddess of the earth, they will be reborn seven times in each of those aerial palaces made of the seven jewels.

source: ལྷའི་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་མྱོང་བར་འགྱུར་རོ། །
en: They will experience the inconceivable bliss of the devas.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་སའི་ལྷ་མོ་བརྟན་མས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེས་ན་སའི་ལྷ་མོ་བརྟན་མ་བདག་དགེ་སློང་ཆོས་སྨྲ་བ་ཆོས་ཀྱིསྟན་ལ་མཆིས་པ་དེའི་ཆོས་ཀྱི་སྟན་གྱི་འོག་ལོགས་ཀྱི་ས་ཕྱོགས་དེ་དང་དེ་དག་ཏུ་གནས་པར་བགྱིའོ། །ཅི་ནས་ཀྱང་སངས་རྒྱས་བརྒྱ་སྟོང་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སེམས་ཅན་དེ་དག་གི་དོན་གྱི་སླད་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛམ་བུའི་གླིང་དུ་ཡུན་རིང་དུ་གནས་ཤིང་མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བ་དང་།
en: When the Bhagavat had spoken, the earth goddess Dṛḍhā said to the Bhagavat, “Therefore, venerable Bhagavat, I, the earth goddess Dṛḍhā, will be present in the ground below the Dharma seat that is the Dharma seat upon which the dharmabhāṇaka bhikṣu is seated.

source: སེམས་ཅན་རྣམས་ཀྱང་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པར་འགྱུར་བ་དང་། མ་འོངས་པའི་དུས་ན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་ལྷ་དང་མིའི་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་མྱོང་བར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་དང་འགྲོགས་པར་འགྱུར་བ་དང་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཤིན་ཏུ་ཆད་པར་འགྱུར་བར་ལུས་མི་གདའ་བར་བགྱིས་ཏེ། དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་རྐང་པ་ལ་ཡན་ལག་གི་དམ་པ་མགོས་བརྟེན་པར་བགྱིའོ། །
en: For the sake of those beings who have planted good roots with hundreds of thousands of buddhas, I will make my body invisible and will support that dharmabhāṇaka bhikṣu’s feet with my highest limb, my head, so that this Lord King of Sūtras, the Sublime Golden Light will remain for a long time in Jambudvīpa and will not disappear soon; so that beings will hear this Lord King of Sūtras, the Sublime Golden Light and will experience the happiness of devas and humans for many hundreds of thousands of quintillions of eons; and so that they will be in the company of tathāgatas and will in a future time attain the highest, most complete enlightenment of buddhahood and become completely free of the suffering of the hells, the lives of animals, and the world of Yama.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། སའི་ལྷ་མོ་བརྟན་མའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་པའོ།། །།
en: This concludes “Dṛḍhā, the Goddess of the Earth,” the tenth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་ལྷན་ཅིག་ཏུ་སྟན་ལས་ལངས་ཏེ། གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། དགོན་པའི་ཕྱོགས་སམ། རིའི་སྨན་ལྗོངས་སམ། ཕོ་བྲང་འཁོར་གང་དུ་འབྱུང་བར་འགྱུར་བ་དེར་བཙུན་པ་བཅོམ་ལྡན་འདས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་བདག་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ།
en: Chapter 11: Saṃjñeya Then the great yakṣa general Saṃjñeya, accompanied by twenty-eight yakṣa generals, rose from his seat and, with his robe over one shoulder, kneeling with his right knee on the ground and with palms together, bowed toward the Bhagavat and said to the Bhagavat, “Venerable Bhagavat, wherever this Lord King of Sūtras, the Sublime Golden Light appears, in the present or in future times, whether in a village, town, market town, region, wilderness, mountain cave, or royal residence, Bhagavat, I, the great yakṣa general Saṃjñeya, accompanied by twenty-eight yakṣa generals, will come to that village, town, market town, region, wilderness, mountain cave, or royal residence.

source: ལྗོངས་སམ། དགོན་པའི་ཕྱོགས་སམ། རིའི་སྨན་ལྗོངས་སམ། ཕོ་བྲང་འཁོར་དེར་མཆི་བར་བགྱིའོ། །ལུས་མི་གདའ་བར་བགྱི་སྟེ་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་བསྲུང་བར་བགྱིའོ། །
en: “I will make my body invisible and will guard that dharmabhāṇaka bhikṣu.

source: སྐྱེས་པའམ་བུད་མེད་དམ་ཁྱེའུ་འམ་བུ་མོ་ཆོས་ཉན་པ་དེ་དག་ཐམས་ཅད་དང་། གང་སུ་དག་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཉན་པ་དང་ཐ་ན་ཚིག་གཅིག་དང་། ཐ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་བྱང་ཆུབ་སེམས་དཔའི་མིང་གཅིག་གམ། དེ་བཞིན་གཤེགས་པའི་མཚན་གཅིག་ཐོས་པར་གྱུར་ཏེ། གཟུང་བ་དང་ཐ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་མིང་ཐོས་པར་གྱུར་ཏེ། གཟུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །རིགས་དེ་དག་དང་། ཁྱིམ་དེ་དག་དང་།
en: “All men, women, boys, or girls who listen to the Dharma, whoever hears and retains even one four-line verse from this Lord King of Sūtras, the Sublime Golden Light or even one line, or even the name of one bodhisattva from this Lord King of Sūtras, the Sublime Golden Light, or the name of one tathāgata, or even just hears and retains the name of this Lord King of Sūtras, the Sublime Golden Light, I will defend them all, take care of them, protect them, save them from punishment, and bring them peace and well-being.

source: གྲོང་དེ་དག་དང་། གྲོང་ཁྱེར་དེ་དག་དང་། གྲོང་རྡལ་དེ་དག་དང་། དགོན་པ་དེ་དག་དང་། ཕོ་བྲང་འཁོར་དེ་དག་ཀྱང་ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །
en: I will defend, take care of, protect, save from punishment, and bring peace and well-being to all those families, those homes, those villages, those towns, those market towns, those wildernesses, and those royal residences.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་གང་དག་གིས། བདག་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་ཞེས་མིང་དུ་ཆགས་པར་གྱུར་ཅེ་ན། འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་མངོན་སུམ་མོ། །
en: “Venerable Bhagavat, why am I named the great yakṣa general Saṃjñeya?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཐམས་ཅད་འཚལ་ཏོ། །ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཚལ་ཏོ། །
en: Venerable Bhagavat, it is because I know all Dharmas, I understand all Dharmas, I comprehend all Dharmas.

source: ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་དོ། །ཆོས་ཐམས་ཅད་ཇི་སྙེད་པ་དང་། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་དང་གནས་པ་གང་ལགས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རིགས་གང་ལགས་པ་དང་། བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་བདག་ལ་མངོན་སུམ་མོ། །
en: Whatever the number of Dharmas, the nature of the Dharmas, or the classes of Dharmas, venerable Bhagavat, I have direct knowledge of all Dharmas.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ལ་བདག་གི་ཡེ་ཤེས་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཡེ་ཤེས་ཀྱི་གསལ་བ་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཡེ་ཤེས་ཀྱི་རྒྱུ་བ་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཡེ་ཤེས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: “Venerable Bhagavat, in all Dharmas my illumination by wisdom is inconceivable, my clarity of wisdom is inconceivable, my activity of wisdom is inconceivable, and my accumulation of wisdom is inconceivable.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ལ་བདག་གི་ཡེ་ཤེས་ཀྱི་ཡུལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་བོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་བདག་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འཚལ་བ་དང་།
en: “Venerable Bhagavat, in all Dharmas my engagement in the field of wisdom is inconceivable.

source: ཡང་དག་པར་ཡོངས་སུ་བརྟགས་པ་དང་། ཡང་དག་པར་ཡོངས་སུ་འཚལ་བ་དང་། ཡང་དག་པར་རྣམ་པར་བལྟས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པའི་རྒྱུ་དེས་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་ཞེས་མིང་དུ་ཆགས་སོ། །
en: “Venerable Bhagavat, it is because of my correct knowledge, my correct examination, my correct view, and my correct comprehension of all Dharmas that I am named the great yakṣa general Saṃjñeya.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་ཚིག་བརྒྱན་པར་བགྱི་བའི་སླད་དུ་སྤོབས་པ་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ། །ཇི་ལྟར་ཆོས་སྨྲ་བ་དེའི་ལུས་མི་ངལ་བར་འགྱུར་བ་དང་། ལུས་ཀྱི་དབང་པོ་བདེ་བར་འགྱུར་བ་དང་། རབ་ཏུ་དགའ་བ་སྐྱེ་བར་འགྱུར་བ་དང་། གང་གི་སླད་དུ་སངས་རྒྱས་བརྒྱ་སྟོང་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་སླད་དུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛམ་བུའི་གླིང་དུ་ཡུན་རིང་དུ་གནས་ཤིང་མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ཀྱང་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པར་འགྱུར་བ་དང་། ཡེ་ཤེས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པར་འགྱུར་བ་དང་།
en: “Venerable Bhagavat, I will bring eloquence to the dharmabhāṇaka bhikṣu in order to beautify his words.
